/**
 * Created by Administrator on 2015/7/3.
 */

//dependencies


//private fields


//core module to export
module.exports = {
    0: '成功',
    1: '失败',
    2: 'token无效',
    3: 'token过期',
    4: 'token错误',
    5: '参数错误',
    1001: '添加群成员超过限制',
    1002:	'群不存在',
    1003:	'群名不合法',
    1004:	'所有加群成员已经存在',
    1005:	'所有踢群成员已经不存在',
    1101:	'没有踢人权限',
    2001:	'用户不存在',
    2002:	'昵称非法',
    2003:	'用户名非法',
    2004:	'用户名不存在',
    2005:	'手机号非法',
    2006:	'手机区号非法',
    2007:	'用户已删除',
    2008:	'头像非法',
    2009:	'验证码非法',
    2010:	'已被拉黑',
    2011:	'已被取消拉黑',
    2012:	'用户已存在',
    2013:	'密码错误'
};

//module initialization


//private functions
